In [3]:
import numpy as np
import pandas as pd
np.random.seed(42)
this=np.random.randint(0, 101, size=10)
print(f"Numpy array is {this}")
that=pd.Series(this)
print(that)

Numpy array is [51 92 14 71 60 20 82 86 74 74]
0    51
1    92
2    14
3    71
4    60
5    20
6    82
7    86
8    74
9    74
dtype: int32

In [5]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
l=pd.Series(ls)
print(l)

0        Apple
1        Tesla
2    Persimmon
3       Adidas
dtype: object

In [9]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x)

A        Apple
B        Tesla
C    Persimmon
D       Adidas
dtype: object

In [12]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.iloc[0])

Apple

In [13]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.iloc[0:3])

A        Apple
B        Tesla
C    Persimmon
dtype: object

In [16]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.loc["A"])

Apple

In [19]:
import pandas as pd
import numpy as np
np.random.seed(42)
this=np.random.randint(0, 101, size=10)
fl=pd.DataFrame(this,columns=['Numbers'])
fl

   Numbers
0       51
1       92
2       14
3       71
4       60
5       20
6       82
7       86
8       74
9       74

In [17]:
import pandas as ujwal
dat=[['Dikesh',12],['Ronish',31],['Ujwal',40]]
df=ujwal.DataFrame(dat,columns=['Name','Roll'])
df

     Name  Roll
0  Dikesh    12
1  Ronish    31
2   Ujwal    40

In [18]:
import pandas as ujwal
fil="F:/UjwalParajuli/python-class/python/practice/pandas/FSI.xlsx"
df=ujwal.read_excel(fil)
df

                      Country  Demo  Refugees  Group  Flight
0                     Somalia  10.0       9.0    8.7     8.6
1                         NaN   9.6       9.6    8.8     6.4
2                 South Sudan   9.7      10.0    8.6     6.5
3   Congo Democratic Republic   9.7       9.8    NaN     6.4
4                       Syria   7.4       9.1    9.1     8.0
5                 Afghanistan   NaN       8.6    8.3     8.5
6                       Sudan   8.8       9.6    9.3     7.5
7                         NaN   9.3       9.5    8.1     6.2
8                        Chad   9.5       9.0    NaN     7.7
9                       Haiti   8.8       7.7    5.5     8.3
10                   Ethiopia   9.8       NaN    8.9     6.2
11                       Mali   8.8       8.5    8.5     7.7
12                     Guinea   8.8       6.2    9.4     NaN
13                        NaN   NaN       6.4    8.6     6.7

In [21]:
import pandas as ujwal
name="F:/UjwalParajuli/python-class/python/practice/pandas/output.csv"
df=ujwal.read_csv(name,on_bad_lines="skip")
df

     Unnamed: 0                                            summary  label
0             0  भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...    1.0
1             1  विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...    2.0
2             2  इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...    0.0
3             3  पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...    0.0
4             4  अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...    1.0
..          ...                                                ...    ...
680         720  नेपालको काँधमा कुल ११ खर्ब रुपैयाँको ऋण छ र हर...    0.0
681         721  श्रीलंकाका अधिकारीहरुले सन् १९८० को दशकताका हज...    0.0
682         722  रुसमा एउटा भव्य समारोहबीच आरम्भ भएको विश्वकप फ...    1.0
683         723  दुई दिनदेखि भारतको उत्तर प्रदेशका सञ्जय कुमारल...    0.0
684         724  इटलीमा कोरोनाभाइसका कारण एकै दिन ४२७ जनाको ज्य...    0.0

[685 rows x 3 columns]

In [22]:
df.head()

   Unnamed: 0                                            summary  label
0           0  भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...    1.0
1           1  विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...    2.0
2           2  इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...    0.0
3           3  पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...    0.0
4           4  अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...    1.0

In [23]:
df.tail()

     Unnamed: 0                                            summary  label
680         720  नेपालको काँधमा कुल ११ खर्ब रुपैयाँको ऋण छ र हर...    0.0
681         721  श्रीलंकाका अधिकारीहरुले सन् १९८० को दशकताका हज...    0.0
682         722  रुसमा एउटा भव्य समारोहबीच आरम्भ भएको विश्वकप फ...    1.0
683         723  दुई दिनदेखि भारतको उत्तर प्रदेशका सञ्जय कुमारल...    0.0
684         724  इटलीमा कोरोनाभाइसका कारण एकै दिन ४२७ जनाको ज्य...    0.0

In [24]:
df.head(10)

   Unnamed: 0                                            summary  label
0           0  भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...    1.0
1           1  विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...    2.0
2           2  इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...    0.0
3           3  पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...    0.0
4           4  अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...    1.0
5           5  स्वाब परीक्षणको सङ्ख्या देशव्यापी रूपमा बढाएर ...    0.0
6           6  प्रधानमन्त्री प्रचण्डले द्वन्द्वकालीन मुद्दामा...    0.0
7           7  अमेरिकी राष्ट्रपति डोनल्ड ट्रम्पविरुद्ध महाभिय...    1.0
8           8  अमेरिकी राष्ट्रपति डोनल्ड ट्रम्पले अमेरिका छिर...    0.0
9           9  अमेरिकाका वैज्ञानिकहरूले क्यान्सर परीक्षणका ला...    2.0

In [25]:
print(f"The shape is {df.shape}")

The shape is (685, 3)

In [28]:
print(f"The index is {df.index}")

The index is RangeIndex(start=0, stop=685, step=1)

In [29]:
print(f"The columns are {df.columns}")

The columns are Index(['Unnamed: 0', 'summary', 'label'], dtype='object')

In [8]:
print(f"The data types are {df.dtypes}")

The data types are Country      object
Demo        float64
Refugees    float64
Group       float64
Flight      float64
dtype: object

In [9]:
print("The values iare ",df.values)

The values iare  [['Somalia' 10.0 9.0 8.7 8.6]
 ['No_Country' 9.6 9.6 8.8 6.4]
 ['South Sudan' 9.7 10.0 8.6 6.5]
 ['Congo Democratic Republic' 9.7 9.8 8.483333333333334 6.4]
 ['Syria' 7.4 9.1 9.1 8.0]
 ['Afghanistan' 9.183333333333332 8.6 8.3 8.5]
 ['Sudan' 8.8 9.6 9.3 7.5]
 ['No_Country' 9.3 9.5 8.1 6.2]
 ['Chad' 9.5 9.0 8.483333333333334 7.7]
 ['Haiti' 8.8 7.7 5.5 8.3]
 ['Ethiopia' 9.8 8.692307692307693 8.9 6.2]
 ['Mali' 8.8 8.5 8.5 7.7]
 ['Guinea' 8.8 6.2 9.4 7.2846153846153845]
 ['No_Country' 9.183333333333332 6.4 8.6 6.7]]

In [11]:
print("The Size is ",df.size)

The Size is  70

In [12]:
print("The dimension is ",df.ndim)

The dimension is  2

In [15]:
print("Is the dataframe empty?: ",df.empty)

Is the dataframe empty?:  False

In [16]:
print("\nThe Transpose is",df.T)

The Transpose is                0           1            2                          3      4   \
Country   Somalia  No_Country  South Sudan  Congo Democratic Republic  Syria
Demo         10.0         9.6          9.7                        9.7    7.4
Refugees      9.0         9.6         10.0                        9.8    9.1
Group         8.7         8.8          8.6                   8.483333    9.1
Flight        8.6         6.4          6.5                        6.4    8.0

                   5      6           7         8      9         10    11  \
Country   Afghanistan  Sudan  No_Country      Chad  Haiti  Ethiopia  Mali
Demo         9.183333    8.8         9.3       9.5    8.8       9.8   8.8
Refugees          8.6    9.6         9.5       9.0    7.7  8.692308   8.5
Group             8.3    9.3         8.1  8.483333    5.5       8.9   8.5
Flight            8.5    7.5         6.2       7.7    8.3       6.2   7.7

                12          13
Country     Guinea  No_Country
Demo           8.8    9.183333
Refugees       6.2         6.4
Group          9.4         8.6
Flight    7.284615         6.7

In [22]:
import pandas as ujwal
filename="/home/nullproj/Documents/BIM-5th-semester/python/practice/pandas/FSINULL.xlsx"
fd=ujwal.read_excel(filename)
print(df.isnull())

    Country   Demo  Refugees  Group  Flight
0     False  False     False  False   False
1     False  False     False  False   False
2     False  False     False  False   False
3     False  False     False  False   False
4     False  False     False  False   False
5     False  False     False  False   False
6     False  False     False  False   False
7     False  False     False  False   False
8     False  False     False  False   False
9     False  False     False  False   False
10    False  False     False  False   False
11    False  False     False  False   False
12    False  False     False  False   False
13    False  False     False  False   False

In [23]:
print(df.notnull())

    Country  Demo  Refugees  Group  Flight
0      True  True      True   True    True
1      True  True      True   True    True
2      True  True      True   True    True
3      True  True      True   True    True
4      True  True      True   True    True
5      True  True      True   True    True
6      True  True      True   True    True
7      True  True      True   True    True
8      True  True      True   True    True
9      True  True      True   True    True
10     True  True      True   True    True
11     True  True      True   True    True
12     True  True      True   True    True
13     True  True      True   True    True

In [24]:
totalnull=df.isnull().sum()
print("Total number of null values",totalnull)

Total number of null values Country     0
Demo        0
Refugees    0
Group       0
Flight      0
dtype: int64

In [25]:
nonulldf = df.dropna()
nonulldf

                      Country       Demo   Refugees     Group    Flight
0                     Somalia  10.000000   9.000000  8.700000  8.600000
1                  No_Country   9.600000   9.600000  8.800000  6.400000
2                 South Sudan   9.700000  10.000000  8.600000  6.500000
3   Congo Democratic Republic   9.700000   9.800000  8.483333  6.400000
4                       Syria   7.400000   9.100000  9.100000  8.000000
5                 Afghanistan   9.183333   8.600000  8.300000  8.500000
6                       Sudan   8.800000   9.600000  9.300000  7.500000
7                  No_Country   9.300000   9.500000  8.100000  6.200000
8                        Chad   9.500000   9.000000  8.483333  7.700000
9                       Haiti   8.800000   7.700000  5.500000  8.300000
10                   Ethiopia   9.800000   8.692308  8.900000  6.200000
11                       Mali   8.800000   8.500000  8.500000  7.700000
12                     Guinea   8.800000   6.200000  9.400000  7.284615
13                 No_Country   9.183333   6.400000  8.600000  6.700000

In [26]:
df

                      Country       Demo   Refugees     Group    Flight
0                     Somalia  10.000000   9.000000  8.700000  8.600000
1                  No_Country   9.600000   9.600000  8.800000  6.400000
2                 South Sudan   9.700000  10.000000  8.600000  6.500000
3   Congo Democratic Republic   9.700000   9.800000  8.483333  6.400000
4                       Syria   7.400000   9.100000  9.100000  8.000000
5                 Afghanistan   9.183333   8.600000  8.300000  8.500000
6                       Sudan   8.800000   9.600000  9.300000  7.500000
7                  No_Country   9.300000   9.500000  8.100000  6.200000
8                        Chad   9.500000   9.000000  8.483333  7.700000
9                       Haiti   8.800000   7.700000  5.500000  8.300000
10                   Ethiopia   9.800000   8.692308  8.900000  6.200000
11                       Mali   8.800000   8.500000  8.500000  7.700000
12                     Guinea   8.800000   6.200000  9.400000  7.284615
13                 No_Country   9.183333   6.400000  8.600000  6.700000

In [27]:
df['Demo'].fillna(45, inplace = True)
df['Refugees'].fillna(45, inplace = True)
df['Group'].fillna(45, inplace = True)
df['Flight'].fillna(45, inplace = True)
df['Country'].fillna('No_Country', inplace = True)
df

/tmp/ipykernel_2499/3180152421.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Demo'].fillna(45, inplace = True)
/tmp/ipykernel_2499/3180152421.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Refugees'].fillna(45, inplace = True)
/tmp/ipykernel_2499/3180152421.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Group'].fillna(45, inplace = True)
/tmp/ipykernel_2499/3180152421.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Flight'].fillna(45, inplace = True)
/tmp/ipykernel_2499/3180152421.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Country'].fillna('No_Country', inplace = True)

                      Country       Demo   Refugees     Group    Flight
0                     Somalia  10.000000   9.000000  8.700000  8.600000
1                  No_Country   9.600000   9.600000  8.800000  6.400000
2                 South Sudan   9.700000  10.000000  8.600000  6.500000
3   Congo Democratic Republic   9.700000   9.800000  8.483333  6.400000
4                       Syria   7.400000   9.100000  9.100000  8.000000
5                 Afghanistan   9.183333   8.600000  8.300000  8.500000
6                       Sudan   8.800000   9.600000  9.300000  7.500000
7                  No_Country   9.300000   9.500000  8.100000  6.200000
8                        Chad   9.500000   9.000000  8.483333  7.700000
9                       Haiti   8.800000   7.700000  5.500000  8.300000
10                   Ethiopia   9.800000   8.692308  8.900000  6.200000
11                       Mali   8.800000   8.500000  8.500000  7.700000
12                     Guinea   8.800000   6.200000  9.400000  7.284615
13                 No_Country   9.183333   6.400000  8.600000  6.700000

In [29]:
import pandas as pd
filename = "/home/nullproj/Documents/BIM-5th-semester/python/practice/pandas/FSINULL.xlsx"
df = pd.read_excel(filename)
print(df[df.isna().any(axis =1)])
#Filling the missing values with the mean valuesdf
df['Demo'].fillna(df['Demo'].mean(), inplace = True)
df['Refugees'].fillna(df['Refugees'].mean(), inplace = True)
df['Group'].fillna(df['Group'].mean(), inplace = True)
df['Flight'].fillna(df['Flight'].mean(), inplace = True)
df['Country'].fillna('No_Country', inplace = True)
df

                      Country  Demo  Refugees  Group  Flight
1                         NaN   9.6       9.6    8.8     6.4
3   Congo Democratic Republic   9.7       9.8    NaN     6.4
5                 Afghanistan   NaN       8.6    8.3     8.5
7                         NaN   9.3       9.5    8.1     6.2
8                        Chad   9.5       9.0    NaN     7.7
10                   Ethiopia   9.8       NaN    8.9     6.2
12                     Guinea   8.8       6.2    9.4     NaN
13                        NaN   NaN       6.4    8.6     6.7

/tmp/ipykernel_2499/3299819051.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Demo'].fillna(df['Demo'].mean(), inplace = True)
/tmp/ipykernel_2499/3299819051.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Refugees'].fillna(df['Refugees'].mean(), inplace = True)
/tmp/ipykernel_2499/3299819051.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Group'].fillna(df['Group'].mean(), inplace = True)
/tmp/ipykernel_2499/3299819051.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Flight'].fillna(df['Flight'].mean(), inplace = True)
/tmp/ipykernel_2499/3299819051.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Country'].fillna('No_Country', inplace = True)

                      Country       Demo   Refugees     Group    Flight
0                     Somalia  10.000000   9.000000  8.700000  8.600000
1                  No_Country   9.600000   9.600000  8.800000  6.400000
2                 South Sudan   9.700000  10.000000  8.600000  6.500000
3   Congo Democratic Republic   9.700000   9.800000  8.483333  6.400000
4                       Syria   7.400000   9.100000  9.100000  8.000000
5                 Afghanistan   9.183333   8.600000  8.300000  8.500000
6                       Sudan   8.800000   9.600000  9.300000  7.500000
7                  No_Country   9.300000   9.500000  8.100000  6.200000
8                        Chad   9.500000   9.000000  8.483333  7.700000
9                       Haiti   8.800000   7.700000  5.500000  8.300000
10                   Ethiopia   9.800000   8.692308  8.900000  6.200000
11                       Mali   8.800000   8.500000  8.500000  7.700000
12                     Guinea   8.800000   6.200000  9.400000  7.284615
13                 No_Country   9.183333   6.400000  8.600000  6.700000

In [30]:
col1 = df['Country']
print(col1)
col2 = df[['Group','Flight']]
print(col2)

0                       Somalia
1                    No_Country
2                   South Sudan
3     Congo Democratic Republic
4                         Syria
5                   Afghanistan
6                         Sudan
7                    No_Country
8                          Chad
9                         Haiti
10                     Ethiopia
11                         Mali
12                       Guinea
13                   No_Country
Name: Country, dtype: object
       Group    Flight
0   8.700000  8.600000
1   8.800000  6.400000
2   8.600000  6.500000
3   8.483333  6.400000
4   9.100000  8.000000
5   8.300000  8.500000
6   9.300000  7.500000
7   8.100000  6.200000
8   8.483333  7.700000
9   5.500000  8.300000
10  8.900000  6.200000
11  8.500000  7.700000
12  9.400000  7.284615
13  8.600000  6.700000

In [31]:
import pandas as pd
filename = "/home/nullproj/Documents/BIM-5th-semester/python/practice/pandas/FSINULL.xlsx"
df = pd.read_excel(filename)
print(df[df.isna().any(axis =1)])
df['Demo'] = df['Demo'].fillna(df['Demo'].mean())
df['Refugees'] = df['Refugees'].fillna(df['Refugees'].mean())
df['Group'] = df['Group'].fillna(df['Group'].mean())
df['Flight'] = df['Flight'].fillna(df['Flight'].mean())
df['Country'] = df['Country'].fillna('No_Country')
df

                      Country  Demo  Refugees  Group  Flight
1                         NaN   9.6       9.6    8.8     6.4
3   Congo Democratic Republic   9.7       9.8    NaN     6.4
5                 Afghanistan   NaN       8.6    8.3     8.5
7                         NaN   9.3       9.5    8.1     6.2
8                        Chad   9.5       9.0    NaN     7.7
10                   Ethiopia   9.8       NaN    8.9     6.2
12                     Guinea   8.8       6.2    9.4     NaN
13                        NaN   NaN       6.4    8.6     6.7

                      Country       Demo   Refugees     Group    Flight
0                     Somalia  10.000000   9.000000  8.700000  8.600000
1                  No_Country   9.600000   9.600000  8.800000  6.400000
2                 South Sudan   9.700000  10.000000  8.600000  6.500000
3   Congo Democratic Republic   9.700000   9.800000  8.483333  6.400000
4                       Syria   7.400000   9.100000  9.100000  8.000000
5                 Afghanistan   9.183333   8.600000  8.300000  8.500000
6                       Sudan   8.800000   9.600000  9.300000  7.500000
7                  No_Country   9.300000   9.500000  8.100000  6.200000
8                        Chad   9.500000   9.000000  8.483333  7.700000
9                       Haiti   8.800000   7.700000  5.500000  8.300000
10                   Ethiopia   9.800000   8.692308  8.900000  6.200000
11                       Mali   8.800000   8.500000  8.500000  7.700000
12                     Guinea   8.800000   6.200000  9.400000  7.284615
13                 No_Country   9.183333   6.400000  8.600000  6.700000